{
    "role": "Software Engineer",
    "job_description": "\n    The Automated Workflows are the core platform feature that helps customers to automate their mundane tasks. Smartsheet supports workflows to notify when a change occurs in a sheet, auto-assign, setup dates, update/clear data and generate documents (PDF/Docusign). Our customers created millions of workflows and we execute tens of millions of workflows every day. We observed around 2x increase in workflow executions every year with improved performance. Come join us to strengthen the platform to support the exponential growth and adding new features to the workflows.\n\n    In 2005, Smartsheet was founded on the idea that teams and millions of people worldwide deserve a better way to deliver their very best work. Today, we deliver a leading cloud-based platform for work execution, empowering organizations to plan, capture, track, automate, and report on work at scale, resulting in more efficient processes and better business outcomes.\n\n    This position will report to our Senior Engineering Manager and can be based remotely from anywhere within the United States where Smartsheet is a registered employer.\n\n    Our team focuses on distributed decision making that rewards ownership, transparency, and collaboration. Learn more about our platform here: Smartsheet Overview Video\n\n    You Will:\n\n        Build scalable back-end services for the next generation of applications at Smartsheet (Kotlin, Java)\n        Solve challenging distributed systems problems and work with modern cloud infrastructure (AWS, Kubernetes)\n        Take part in code reviews and architectural discussions as you work with other software engineers and product managers\n        Mentor junior engineers on code quality and other industry best practices\n        Forge a strong partnership with product management and other key areas of the business\n\n    You Have:\n\n        2+ years software development experience building highly scalable, highly available applications\n        2+ years of programming experience with full stack technologies such Java, Kotlin or TypeScript\n        2+ years Infrastructure management (Terraform, Terragrunt or Pulumi)\n        2+ years of experience with cloud technologies (AWS, Azure, etc.)\n        Experience developing, documenting, and supporting REST APIs\n        Front-end development experience is plus (React, JavaScript, VueJS or Angular)\n        A degree in Computer Science, Engineering, or a related field or equivalent practical experience\n        Legally eligible to work in the U.S. on an ongoing basis\n\n    Perks & Benefits:\n\n        HSA, 100% employer-paid premiums, or buy-up medical/vision and dental coverage options for full-time employees\n        Equity - Restricted Stock Units (RSUs) with all offers\n        Lucrative Employee Stock Purchase Program (15% discount)\n        401k Match to help you save for your future (50% of your contribution up to the first 6% of your eligible pay)\n        Monthly stipend to support your work and productivity\n        Flexible Time Away Program, plus Incidental Sick Leave\n        Up to 24 weeks of Parental Leave\n        Personal paid Volunteer Day to support our community\n        Opportunities for professional growth and development including access to LinkedIn Learning online courses\n        Company Funded Perks, including a counseling membership, local retail discounts, and your own personal Smartsheet account\n        Teleworking options from any registered location in the U.S. (role specific) \n        US employees are automatically covered under Smartsheet-sponsored life insurance, short-term, and long-term disability plans\n        US employees receive 12 paid holidays per year\n\n    Smartsheet provides a competitive range of compensation for roles that may be hired in different geographic areas we are licensed to operate our business from. Actual compensation is determined by several factors including, but not limited to, level of professional, educational experience, skills, and specific candidate location. In addition, this role will be eligible for a market competitive bonus and RSU stock grant upon accepted offer. California & New York: $124,200 to $180,900 | All other US States: $115,000 to $167,500\n\n    Equal Opportunity Employer:\n\n    Smartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, Germany, Costa Rica, Japan and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\n    At Smartsheet, we strive to build an inclusive environment that encourages, supports, and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We’re looking for people who are driven, authentic, supportive, effective, and honest. You’re encouraged to apply even if your experience doesn’t precisely match our job description—if your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren’t afraid to be innovative—join us! \n    ",
    "company": "Google",
    "resume": "\n    Shubh Khandelwal\n    Full-Stack Software Engineer | Python, JS, Java | ML/AI/NLP Enthusiast\n    shubhvk10@gmail.com ·(602) 380-5667 ·linkedin.com/in/shubhk7 ·github.com/caffeinelover1012\n    Education\n    Arizona State University, Tempe, AZ Aug 2020 - May 2024\n    BS in Computer Science (Dean’s List Recipient) GPA: 4.00\n    Relevant Coursework: Data Structures and Algorithms, Object Oriented Programming, Operating Systems,\n    Database Management, Principles of Programming, Advanced Physics (UGTA), Advanced Machine Learning\n    Professional Experience\n    Full-Stack Software Engineering Intern Bellevue, WA\n    Smartsheet Inc. ·Licensing and Payments team May 2023 - Aug 2023\n    •Developed 30+ REST API SaaS architecture services using Java, Javascript, Spring Boot, MySQL,\n    DynamoDB, Maven, ReactJS, NodeJS, Docker and Ansible to support multi-line item subscriptions.\n    •Engineered a serverless architecture using AWS Cloudwatch, ECS, Lambda, SQS and SES to automate email\n    notifications for Seamless Trial Evaluations, resulting in a scalable and cost-efficient solution.\n    •Provisioned AWS instances using Terraform, Terragrunt and Docker. Wrote JUnit tests and integration tests\n    to improve library automated test coverage by 87%. Configured the Lingoport Globalyzer and CI/CD\n    pipelines in 8 Git repositories to promote internationalization and generate i18n reports.\n    Software Developer Intern Tempe, AZ\n    School of Earth and Space Exploration ·ASU Apr 2022 - Jan 2023\n    •Developed and maintained software applications for the MARS-2020 MastCam-Z NASA space mission\n    operations using Python automation scripting, Django, Linux MakeFiles, jQuery, PostgreSQL.\n    •Implemented a new search portal to display the sequences, images, and observations data captured by the\n    Mars Rover and a caching mechanism resulting in a 90%reduction in search time.\n    CTO and Co-founder MP, India\n    Infocard Apr 2022 - Present\n    •Co-founded Infocard, an NFC digital business card startup, which elevates the networking capabilities of\n    professionals. Led the design and development of the platform using technologies like MongoDB, Express.js,\n    React, Node.js, Redux and Bootstrap. Serving over 700+infocard users worldwide.\n    Machine Learning Research Assistant Mesa, AZ\n    W.P. Carey Morrison School of Agribusiness ·ASU Jan 2023 - Present\n    •Working with Prof. Lauren Chenarides to create DIFA, a comprehensive data catalog tool that provides\n    dataset-specific information, elevating the research capabilities of agricultural and applied economists.\n    •Leveraging Machine Learning, Named Entity Recognition, NLP using Spacy and TensorFlow for dataset\n    detection and Neo4j Graph DB for computation of linkage metrics using a knowledge graph.\n    •Created Python web scrapers for 200+datasets using Selenium and a Full-Stack Web App and REST APIs\n    using Django to display the knowledge graphs. Deployed with auto-scaling on AWS EC2.\n    Projects\n    Sentiment Analysis as a Service ·NLP, NLTK, Django, Heroku GitHub\n    •Leveraged Natural Language Processing to analyze text, tokenize words and compute the sentiment score.\n    •Developed REST APIs and a web application using Django to provide access to the analysis results.\n    Worksheet Wizard ·Flask, React, SQLite, Cohere LLM Devpost\n    •An innovative AI-powered educational platform, for UCLA Hackathon; the platform automatically generates\n    custom worksheets from diverse multimedia content, utilizing Python, Flask, Cohere API, and NLP.\n    Zuckbook ·Flask, MySQL, Bootstrap\n    •A comprehensive Instagram clone, leveraging Flask and MySQL for the management and storage of user data,\n    photo data, and other essential platform information.\n    Certifications and Leadership Involvement\n    Technical Officer ·Software Developer Association of ASU Jan 2023 - Present\n    •Managing an organization with 2200+ members as a Technical Officer, leading technical presentations on\n    Python Automation, Machine Learning, Git and Modern Tech Stacks within the industry.\n    AWS Certified Cloud Practitioner Aug 2022\n    Technical Skills\n    Languages: Python, Java, JavaScript, HTML, CSS, C/C++, C#, SQL, Dart\n    Tools/Frameworks: Django, Flask, Node.js, React, Spring, Linux, MVC, Bootstrap, jQuery, AJAX\n    DB: PostgreSQL, MySQL, SQLite, ORMs, Redis, MongoDB, DynamoDB\n    DevOps: JUnit, Agile, Scrum, Maven, Git, REST APIs, Ansible, Jira, Docker\n    ",
    "name": "Shubh",
    "interview_so_far": [],
    "n": 10
}